src/test/resources/stripe-charge-invalid-email.json

{
  "id": "evt_3KBMgdHAwJOu5brr1Eiccntj",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1640624920,
  "data": {
    "object": {
      "id": "pi_3KBMgdHAwJOu5brr1JtKjpWJ",
      "object": "payment_intent",
      "amount": 1000,
      "amount_capturable": 0,
      "amount_received": 1000,
      "application": null,
      "application_fee_amount": null,
      "automatic_payment_methods": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "charges": {
        "object": "list",
        "data": [
          {
            "id": "ch_3KBMgdHAwJOu5brr1UiBlOvS",
            "object": "charge",
            "amount": 1000,
            "amount_captured": 1000,
            "amount_refunded": 0,
            "application": null,
            "application_fee": null,
            "application_fee_amount": null,
            "balance_transaction": "txn_3KBMgdHAwJOu5brr1ZPfJZfY",
            "billing_details": {
              "address": {
                "city": null,
                "country": null,
                "line1": null,
                "line2": null,
                "postal_code": null,
                "state": null
              },
              "email": null,
              "name": null,
              "phone": null
            },
            "calculated_statement_descriptor": "IMPACT UPGRADE",
            "captured": true,
            "created": 1640624919,
            "currency": "usd",
            "customer": "cus_Kr4pbf6nCPGKnd",
            "description": null,
            "destination": null,
            "dispute": null,
            "disputed": false,
            "failure_code": null,
            "failure_message": null,
            "fraud_details": {
            },
            "invoice": null,
            "livemode": false,
            "metadata": {
            },
            "on_behalf_of": null,
            "order": null,
            "outcome": {
              "network_status": "approved_by_network",
              "reason": null,
              "risk_level": "normal",
              "risk_score": 53,
              "seller_message": "Payment complete.",
              "type": "authorized"
            },
            "paid": true,
            "payment_intent": "pi_3KBMgdHAwJOu5brr1JtKjpWJ",
            "payment_method": "card_1KBMgNHAwJOu5brr4zL25ddi",
            "payment_method_details": {
              "card": {
                "brand": "visa",
                "checks": {
                  "address_line1_check": null,
                  "address_postal_code_check": null,
                  "cvc_check": "pass"
                },
                "country": "US",
                "exp_month": 12,
                "exp_year": 2030,
                "fingerprint": "WHTBeQ5HmOeHlWfu",
                "funding": "credit",
                "installments": null,
                "last4": "4242",
                "network": "visa",
                "three_d_secure": null,
                "wallet": null
              },
              "type": "card"
            },
            "receipt_email": null,
            "receipt_number": null,
            "receipt_url": "https://pay.stripe.com/receipts/acct_1Imqu3HAwJOu5brr/ch_3KBMgdHAwJOu5brr1UiBlOvS/rcpt_Kr4qL969NGj1wVGFkWxtUgJ2FyCrsiS",
            "refunded": false,
            "refunds": {
              "object": "list",
              "data": [
              ],
              "has_more": false,
              "total_count": 0,
              "url": "/v1/charges/ch_3KBMgdHAwJOu5brr1UiBlOvS/refunds"
            },
            "review": null,
            "shipping": null,
            "source": {
              "id": "card_1KBMgNHAwJOu5brr4zL25ddi",
              "object": "card",
              "address_city": null,
              "address_country": null,
              "address_line1": null,
              "address_line1_check": null,
              "address_line2": null,
              "address_state": null,
              "address_zip": null,
              "address_zip_check": null,
              "brand": "Visa",
              "country": "US",
              "customer": "cus_Kr4pbf6nCPGKnd",
              "cvc_check": "pass",
              "dynamic_last4": null,
              "exp_month": 12,
              "exp_year": 2030,
              "fingerprint": "WHTBeQ5HmOeHlWfu",
              "funding": "credit",
              "last4": "4242",
              "metadata": {
              },
              "name": null,
              "tokenization_method": null
            },
            "source_transfer": null,
            "statement_descriptor": "Impact Upgrade",
            "statement_descriptor_suffix": null,
            "status": "succeeded",
            "transfer_data": null,
            "transfer_group": null
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/charges?payment_intent=pi_3KBMgdHAwJOu5brr1JtKjpWJ"
      },
      "client_secret": "pi_3KBMgdHAwJOu5brr1JtKjpWJ_secret_g7o6A9X5KdakSRztdMZ7Qhaqo",
      "confirmation_method": "automatic",
      "created": 1640624919,
      "currency": "usd",
      "customer": "cus_Kr4pbf6nCPGKnd",
      "description": null,
      "invoice": null,
      "last_payment_error": null,
      "livemode": false,
      "metadata": {
      },
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": null,
      "payment_method_options": {
        "card": {
          "installments": null,
          "network": null,
          "request_three_d_secure": "automatic"
        }
      },
      "payment_method_types": [
        "card"
      ],
      "processing": null,
      "receipt_email": null,
      "review": null,
      "setup_future_usage": null,
      "shipping": null,
      "source": "card_1KBMgNHAwJOu5brr4zL25ddi",
      "statement_descriptor": "Impact Upgrade",
      "statement_descriptor_suffix": null,
      "status": "succeeded",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 5,
  "request": {
    "id": "req_0uSVllp2N8sXXo",
    "idempotency_key": "a92734cb-8bfa-4c40-bad4-665f5e5f5773"
  },
  "type": "payment_intent.succeeded"
}